// -----// IR Dump Before DefaultTppPasses (default-tpp-passes) ('builtin.module' operation) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before TransformDropSchedule (transform-drop-schedule) ('builtin.module' operation) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before RewriteBatchMatmulToMatmul (rewrite-batch-matmul-to-matmul) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before TppMapping (tpp-mapping) ('builtin.module' operation) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before ConvInitSimplify (conv-init-simplify) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before Cleanup (cleanup) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before Canonicalizer (canonicalize) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before CSE (cse) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before PackConv2DNhwcHwcf (pack-conv2DNhwcHwcf) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before PackConv2DNchwFchw (pack-conv2DNchwFchw) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before RewriteConvToMatmulOrBrgemm (rewrite-conv-to-matmul-or-brgemm) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before PackMatmul (pack-matmul) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1) -> (d1)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = linalg.matmul ins(%collapsed, %transposed : tensor<64x262144xf32>, tensor<262144x128xf32>) outs(%2 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%arg1, %3 : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %6 = arith.addf %in, %in_0 : f32
      linalg.yield %6 : f32
    } -> tensor<64x128xf32>
    %5 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%4 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %6 = arith.cmpf ugt, %in, %cst : f32
      %7 = arith.select %6, %in, %cst : f32
      linalg.yield %7 : f32
    } -> tensor<64x128xf32>
    return %5 : tensor<64x128xf32>
  }
}


// -----// IR Dump After PackMatmul (pack-matmul) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1) -> (d1)>
#map4 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_1 = tensor.pack %2 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %5 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%pack_1 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.mulf %in, %in_2 : f32
      %10 = arith.addf %out, %9 : f32
      linalg.yield %10 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %6 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %7 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%arg1, %unpack : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.addf %in, %in_2 : f32
      linalg.yield %9 : f32
    } -> tensor<64x128xf32>
    %8 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%7 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %9 = arith.cmpf ugt, %in, %cst : f32
      %10 = arith.select %9, %in, %cst : f32
      linalg.yield %10 : f32
    } -> tensor<64x128xf32>
    return %8 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before PackVNNI (pack-vnni) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1) -> (d1)>
#map4 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_1 = tensor.pack %2 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %5 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%pack_1 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.mulf %in, %in_2 : f32
      %10 = arith.addf %out, %9 : f32
      linalg.yield %10 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %6 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %7 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%arg1, %unpack : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.addf %in, %in_2 : f32
      linalg.yield %9 : f32
    } -> tensor<64x128xf32>
    %8 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%7 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %9 = arith.cmpf ugt, %in, %cst : f32
      %10 = arith.select %9, %in, %cst : f32
      linalg.yield %10 : f32
    } -> tensor<64x128xf32>
    return %8 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before PropagatePackUnPack (propagate-pack-and-unpack) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1) -> (d1)>
#map4 = affine_map<(d0, d1) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_1 = tensor.pack %2 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %5 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%pack_1 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.mulf %in, %in_2 : f32
      %10 = arith.addf %out, %9 : f32
      linalg.yield %10 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %6 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %7 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%arg1, %unpack : tensor<128xf32>, tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %in_2: f32, %out: f32):
      %9 = arith.addf %in, %in_2 : f32
      linalg.yield %9 : f32
    } -> tensor<64x128xf32>
    %8 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel"]} ins(%7 : tensor<64x128xf32>) outs(%1 : tensor<64x128xf32>) {
    ^bb0(%in: f32, %out: f32):
      %9 = arith.cmpf ugt, %in, %cst : f32
      %10 = arith.select %9, %in, %cst : f32
      linalg.yield %10 : f32
    } -> tensor<64x128xf32>
    return %8 : tensor<64x128xf32>
  }
}


// -----// IR Dump After PropagatePackUnPack (propagate-pack-and-unpack) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_1 = tensor.pack %2 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %5 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%pack_1 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_7: f32, %out: f32):
      %14 = arith.mulf %in, %in_7 : f32
      %15 = arith.addf %out, %14 : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %6 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %7 = tensor.empty() : tensor<2x4x32x32xf32>
    %8 = tensor.empty() : tensor<4x32xf32>
    %pack_2 = tensor.pack %arg1 inner_dims_pos = [0] inner_tiles = [32] into %8 : tensor<128xf32> -> tensor<4x32xf32>
    %9 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_3 = tensor.pack %unpack inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %9 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %10 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_2, %pack_3 : tensor<4x32xf32>, tensor<2x4x32x32xf32>) outs(%7 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_7: f32, %out: f32):
      %14 = arith.addf %in, %in_7 : f32
      linalg.yield %14 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_4 = tensor.unpack %10 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %11 = tensor.empty() : tensor<2x4x32x32xf32>
    %12 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_5 = tensor.pack %unpack_4 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %12 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %13 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_5 : tensor<2x4x32x32xf32>) outs(%11 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %out: f32):
      %14 = arith.cmpf ugt, %in, %cst : f32
      %15 = arith.select %14, %in, %cst : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_6 = tensor.unpack %13 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    return %unpack_6 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before ConstantFoldPack (constant-fold-pack) ('builtin.module' operation) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_1 = tensor.pack %2 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %5 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%pack_1 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_7: f32, %out: f32):
      %14 = arith.mulf %in, %in_7 : f32
      %15 = arith.addf %out, %14 : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %6 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %7 = tensor.empty() : tensor<2x4x32x32xf32>
    %8 = tensor.empty() : tensor<4x32xf32>
    %pack_2 = tensor.pack %arg1 inner_dims_pos = [0] inner_tiles = [32] into %8 : tensor<128xf32> -> tensor<4x32xf32>
    %9 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_3 = tensor.pack %unpack inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %9 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %10 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_2, %pack_3 : tensor<4x32xf32>, tensor<2x4x32x32xf32>) outs(%7 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_7: f32, %out: f32):
      %14 = arith.addf %in, %in_7 : f32
      linalg.yield %14 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_4 = tensor.unpack %10 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %11 = tensor.empty() : tensor<2x4x32x32xf32>
    %12 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_5 = tensor.pack %unpack_4 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %12 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %13 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_5 : tensor<2x4x32x32xf32>) outs(%11 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %out: f32):
      %14 = arith.cmpf ugt, %in, %cst : f32
      %15 = arith.select %14, %in, %cst : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_6 = tensor.unpack %13 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    return %unpack_6 : tensor<64x128xf32>
  }
}


// -----// IR Dump After ConstantFoldPack (constant-fold-pack) ('builtin.module' operation) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %6 = linalg.fill ins(%cst : f32) outs(%5 : tensor<2x4x32x32xf32>) -> tensor<2x4x32x32xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%6 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_6: f32, %out: f32):
      %15 = arith.mulf %in, %in_6 : f32
      %16 = arith.addf %out, %15 : f32
      linalg.yield %16 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %7 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %8 = tensor.empty() : tensor<2x4x32x32xf32>
    %9 = tensor.empty() : tensor<4x32xf32>
    %pack_1 = tensor.pack %arg1 inner_dims_pos = [0] inner_tiles = [32] into %9 : tensor<128xf32> -> tensor<4x32xf32>
    %10 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_2 = tensor.pack %unpack inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %10 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %11 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_1, %pack_2 : tensor<4x32xf32>, tensor<2x4x32x32xf32>) outs(%8 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_6: f32, %out: f32):
      %15 = arith.addf %in, %in_6 : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_3 = tensor.unpack %11 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %12 = tensor.empty() : tensor<2x4x32x32xf32>
    %13 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_4 = tensor.pack %unpack_3 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %13 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %14 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_4 : tensor<2x4x32x32xf32>) outs(%12 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %out: f32):
      %15 = arith.cmpf ugt, %in, %cst : f32
      %16 = arith.select %15, %in, %cst : f32
      linalg.yield %16 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_5 = tensor.unpack %14 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    return %unpack_5 : tensor<64x128xf32>
  }
}


// -----// IR Dump Before SimplifyAndCanonicalizePack (simplify-pack) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %6 = linalg.fill ins(%cst : f32) outs(%5 : tensor<2x4x32x32xf32>) -> tensor<2x4x32x32xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%6 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_6: f32, %out: f32):
      %15 = arith.mulf %in, %in_6 : f32
      %16 = arith.addf %out, %15 : f32
      linalg.yield %16 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %7 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %8 = tensor.empty() : tensor<2x4x32x32xf32>
    %9 = tensor.empty() : tensor<4x32xf32>
    %pack_1 = tensor.pack %arg1 inner_dims_pos = [0] inner_tiles = [32] into %9 : tensor<128xf32> -> tensor<4x32xf32>
    %10 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_2 = tensor.pack %unpack inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %10 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %11 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_1, %pack_2 : tensor<4x32xf32>, tensor<2x4x32x32xf32>) outs(%8 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_6: f32, %out: f32):
      %15 = arith.addf %in, %in_6 : f32
      linalg.yield %15 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_3 = tensor.unpack %11 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    %12 = tensor.empty() : tensor<2x4x32x32xf32>
    %13 = tensor.empty() : tensor<2x4x32x32xf32>
    %pack_4 = tensor.pack %unpack_3 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %13 : tensor<64x128xf32> -> tensor<2x4x32x32xf32>
    %14 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%pack_4 : tensor<2x4x32x32xf32>) outs(%12 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %out: f32):
      %15 = arith.cmpf ugt, %in, %cst : f32
      %16 = arith.select %15, %in, %cst : f32
      linalg.yield %16 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack_5 = tensor.unpack %14 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    return %unpack_5 : tensor<64x128xf32>
  }
}


// -----// IR Dump After SimplifyAndCanonicalizePack (simplify-pack) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %6 = linalg.fill ins(%cst : f32) outs(%5 : tensor<2x4x32x32xf32>) -> tensor<2x4x32x32xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%6 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %12 = arith.mulf %in, %in_1 : f32
      %13 = arith.addf %out, %12 : f32
      linalg.yield %13 : f32
    } -> tensor<2x4x32x32xf32>
    %8 = tensor.empty() : tensor<2x4x32x32xf32>
    %expanded = tensor.expand_shape %arg1 [[0, 1]] : tensor<128xf32> into tensor<4x32xf32>
    %9 = linalg.generic {indexing_maps = [#map3, #map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded, %7 : tensor<4x32xf32>, tensor<2x4x32x32xf32>) outs(%8 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %12 = arith.addf %in, %in_1 : f32
      linalg.yield %12 : f32
    } -> tensor<2x4x32x32xf32>
    %10 = tensor.empty() : tensor<2x4x32x32xf32>
    %11 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%9 : tensor<2x4x32x32xf32>) outs(%10 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %out: f32):
      %12 = arith.cmpf ugt, %in, %cst : f32
      %13 = arith.select %12, %in, %cst : f32
      linalg.yield %13 : f32
    } -> tensor<2x4x32x32xf32>
    %unpack = tensor.unpack %11 inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %2 : tensor<2x4x32x32xf32> -> tensor<64x128xf32>
    return %unpack : tensor<64x128xf32>
  }
}


// -----// IR Dump Before Cleanup (cleanup) ('func.func' operation: @MLP) //----- //
#map = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d2, d3, d5)>
#map1 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d1, d2, d5, d4)>
#map2 = affine_map<(d0, d1, d2, d3, d4, d5) -> (d0, d1, d3, d4)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d1, d3)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
module attributes {torch.debug_module_name = "MLP"} {
  func.func @MLP(%arg0: tensor<128x262144xf32>, %arg1: tensor<128xf32>, %arg2: tensor<64x512x512xf32>) -> tensor<64x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %collapsed = tensor.collapse_shape %arg2 [[0], [1, 2]] : tensor<64x512x512xf32> into tensor<64x262144xf32>
    %0 = tensor.empty() : tensor<262144x128xf32>
    %transposed = linalg.transpose ins(%arg0 : tensor<128x262144xf32>) outs(%0 : tensor<262144x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<64x128xf32>
    %2 = linalg.fill ins(%cst : f32) outs(%1 : tensor<64x128xf32>) -> tensor<64x128xf32>
    %3 = tensor.empty() : tensor<2x8192x32x32xf32>
    %pack = tensor.pack %collapsed inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %3 : tensor<64x262144xf32> -> tensor<2x8192x32x32xf32>
    %4 = tensor.empty() : tensor<4x8192x32x32xf32>
    %pack_0 = tensor.pack %transposed outer_dims_perm = [1, 0] inner_dims_pos = [0, 1] inner_tiles = [32, 32] into %4 : tensor<262144x128xf32> -> tensor<4x8192x32x32xf32>
    %5 = tensor.empty() : tensor<2x4x32x32xf32>
    %6 = linalg.fill ins(%cst : f32) outs(%5 : tensor<2x4x32x32xf32>) -> tensor<2x4x32x32xf32>
    %7 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction", "parallel", "parallel", "reduction"]} ins(%pack, %pack_0 : tensor<2x8192x32x32xf32>, tensor<4x8192x32x32xf32>) outs(%6 : tensor<2x4x32x32xf32>) {
    ^bb0(%in: f32, %in_1: f32, %out: f32):
      %12 = arith.mulf %in, %in_1 : f32
      %13 = arith.addf %out, %12 : f32
      linalg.yield %13 : f32
    } -> tensor<2x4x32x32xf32>
    %8 = tensor.empty() : tensor<2x4x32x32xf32>
    %expanded = tensor.expand_shape %arg1 [[0, 1]] : tensor<128xf32> into tensor<4x32xf32>
